const 说明={
    界面说明:["jm:界面。","pst:空间数据，x,y,长，宽。",],
    界面相关变量:["hdn:0隐藏，1显示",
    "sfbl:bl缩放比例，sf:默认5中心缩放；1定左上，向右下缩放。2定（中）上，向下缩放……9定右下，向左上缩放",
    "index:层级，默认0",
    "倾斜：平放，竖起，左侧，右侧",
    "透明度：各图层透明度分配/衰减方案",
    ],
    界面元素:["人类","事类","物类",],
    界面元素属性:['重要性/显著度','影响力','可信/可靠/精确度//演义/离谱度','(读者)关注度：关注，默认，屏蔽'],
}
const dings={
    descr:{descr:'对本{}中所有一级key的描述，程序中应当用不到，方便人工查看。有必要时，下级{}中也可添加属于其各自的descr条目。',bgimg:'所有可能用到的背景图片。文本区与时间线区的。',cydd:'常用地点，临时使用，可用于校准/拟合地图定位。',},
    bgimg:[{src:'img/wbbj0.jpg',siz:[720,720]},{src:'img/sjx0.jpg',siz:[1280,80]},],
    cydd:{
        index:{xd:{描述:"现代",time:"now"},},
        xd:{
        twn:["台湾南端",120.786,21.894],    dln:["大连",121.613,38.92],         amd:["澳门",113.546,22],
        xian:["西安",108.933,34.345],       cangan:["长安",108.905,34.161],     xianyang:["咸阳",108.708,34.333],
        loyang:["洛阳",112.452,34.6266],    denzou:["郑州",113.6245,34.756],    xucang:["许昌",113.85,34.047],
        puyang:["濮阳",115.027,35.77],      yecen:["邺城",114.46,36.31],        zibo:["淄博",118.0536,36.824],
        cendu:["成都",104.067,30.583],      mianyang:["绵阳",104.679,31.475],   beijin:["北京",116.407,39.9],
        sanhaig:["山海关",119.76,40.008],   jinan:["济南",117.12,36.66],        qinzou:["青州",118.5,36.684],
        taiyuan:["太原",112.548,37.88],     sijianz:["石家庄",114.516,38.053],  yanmen:["雁门关",112.884,39.184],
        wuhan:["武汉",114.305,30.604],      cangsa:["长沙",112.939,28.24],      nanjin:["南京",118.794,32.0677],
        hefei:["合肥",117.225,31.828],      xuzou:["徐州",117.28,34.219],       hangzou:["杭州",120.155,30.2849],
        nancang:["南昌",115.85,28.69],      lanzou:["兰州",103.832,36.07],      yincuan:["银川",106.2333,38.4952],
        senyang:["沈阳",123.46,41.687],     hhht:["呼和浩特",111.7479,40.851],  baotou:["包头",109.84,40.6624],
        kunmin:["昆明",102.834,24.89],      guiyang:["贵阳",106.628,26.656],    conqin:["重庆",106.55,29.571],
        nanyang:["南阳",112.528,33],        xiangyang:["襄阳",112.12,32.021],   jinzou:["荆州",112.235,30.348],
        cibi:["赤壁",113.87,29.73],         jiange:["剑阁",105.518,32.259],     tiansui:["天水",105.723,34.589],
        wuzyuan:["五丈原",107.63,34.258],   hanzon:["汉中",107.020,33.080],     jiaozi:["交趾",105.85,21.03]
    },
    },
}
const bians={
    descr:{
        descr:'对本{}中所有一级key的描述，程序中应当用不到，方便人工查看。有必要时，下级{}中也可添加属于其各自的descr条目。',
        hporsp:"横屏0或竖屏1",
        wbgs:'文本格式',
        btns:'按钮们',
        wb:'当前所用的节点群们，以及所有已定义的节点群的库（这一部分或应分出一个独立的json文件）',
        jd:'当前所有可能用到的时空节点们，以及所有已标记的时空节点……这一部分同样可以（按年代或区域或门类等）分出许多独立的json文件或数据库。',
        buju:'//布局//布局改区划//区域划分：纯屏幕比例元数据。',
        sjx:'时间线相关的一些数据',
        kjd:'空间点。当前时空节点对应的空间点，以及所有（本时空节点群们）可能用到的时空节点的空间点（名称，经纬，对应当前地图的位置）。无默认数据，纯由程序生成，可能会存到本地存储数据中。'
    },
    hporsp:0,  
    wbgs:{
        H1:{font:"bolder 36px Arial"},H2:{font:"bolder 30px Arial"},H3:{font:"bold 24px Arial"},H4:{font:"bold 18px Arial"},
        p1:{font:"12px Arial"},px:{font:"italic 12px Arial"},pb:{font:"bold 12px Arial"},
    },
    buju:{
        descr:{descr:'对本{}中所有一级key的描述，程序中应当用不到，方便人工查看。有必要时，下级{}中也可添加属于其各自的descr条目。',
            ms:'模式：mr:默认。zdy:自定义，自定义三视界各自占比。',
            wbvs:'文本（是否）显示：文本区wbq,地图区dtq,时间线区sxq是[1,1,1]否显示大标题，小标题/节点名,节点内容。',},
        ms:'mr',
        mr:{
            vs    :[1,1,1],     //显示模式:[1图，2文，3时间线]；0不显示。。[1,2,3]均衡模式；[1,0,3]图线模式；[0,2,3]文线；[1,2,0]图文；[1,0,0]全图;[0,2,0]全文；[0,0,3]全线；[1,1,3]图图线；[1,1,0]图图；[2,2,3]文文线；[2,2,0]文文。
            //[x,y,w,h]
            h111   :[[[0,1],[0,1],[1,2],[8,9]],[[1,2],[0,1],[1,2],[8,9]],[[0,1],[8,9],[1,1],[1,9]],],   //横屏，显示比例(x占1/2，y占8/9)
            h110   :[[[0,1],[0,1],[1,2],[1,1]],[[1,2],[0,1],[1,2],[1,1]],[[0,1],[8,9],[1,1],[0,1]],],   //横屏
            h101   :[[[0,1],[0,1],[1,1],[8,9]],[[1,1],[0,1],[0,1],[8,9]],[[0,1],[8,9],[1,1],[1,9]],],   //横屏
            h100   :[[[0,1],[0,1],[1,1],[1,1]],[[1,1],[0,1],[0,1],[8,9]],[[0,1],[8,9],[1,1],[0,1]],],   //横屏
            h011   :[[[0,1],[0,1],[0,1],[8,9]],[[0,1],[0,1],[1,1],[8,9]],[[0,1],[8,9],[1,1],[1,9]],],   //横屏
            h010   :[[[0,1],[0,1],[0,1],[1,1]],[[0,1],[0,1],[1,1],[1,1]],[[0,1],[8,9],[1,1],[0,1]],],   //横屏
            h001   :[[[0,1],[0,1],[0,1],[8,9]],[[1,1],[0,1],[0,1],[8,9]],[[0,1],[0,1],[1,1],[1,1]],],   //横屏
            s111   :[[[0,1],[0,1],[1,1],[4,9]],[[0,1],[4,9],[1,1],[4,9]],[[0,1],[8,9],[1,1],[1,9]],],   //竖屏
            s101   :[[[0,1],[0,1],[1,1],[8,9]],[[0,1],[8,9],[1,1],[0,1]],[[0,1],[8,9],[1,1],[1,9]],],   //竖屏
            s110   :[[[0,1],[0,1],[1,1],[1,2]],[[0,1],[1,2],[1,1],[1,2]],[[0,1],[1,1],[1,1],[0,1]],],   //竖屏
            s100   :[[[0,1],[0,1],[1,1],[1,1]],[[0,1],[1,1],[1,1],[0,1]],[[0,1],[1,1],[1,1],[0,1]],],   //竖屏
            s011   :[[[0,1],[0,1],[1,1],[0,1]],[[0,1],[0,1],[1,1],[8,9]],[[0,1],[8,9],[1,1],[1,9]],],   //竖屏
            s001   :[[[0,1],[0,1],[1,1],[0,1]],[[0,1],[0,1],[1,1],[0,1]],[[0,1],[0,1],[1,1],[1,1]],],   //竖屏
            s010   :[[[0,1],[0,1],[1,1],[0,1]],[[0,1],[0,1],[1,1],[1,1]],[[0,1],[1,1],[1,1],[0,1]],],   //竖屏
        },
        wbvs:{wbq:[1,1,1],dtq:[1,1,1],sxq:[1,1,1],}
    },
    btns:{
        map:{vs:1,img:{src:"img/btnmap.jpg",siz:[100,400]},p:{l:[1,50],b:[1,50],w:[1,24],h:[1,8],hm:[80,160],s:[0,0,0,0]}},},
    wb:{
        lang:["chs"],
        descr:{lang:'语言，本文本中所有可用语言版本。不是当前所用语言，当前所用语言应在程序中设置',chs:'中文（版本的文本）',},
        chs:{
            descr:{sysm:'使用说明',slwb:'示例文本'},
            sysm:{
                descr:{tt:'标题',nr:'内容'},
                tt:["使用说明","h1"],
                nr:[
                    {
                    bt:["界面","h2"],
                    nr:[["界面内容","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["切换界面布局","h3"],["图文时三界面皆可显示或隐藏。由此衍生图文，图时，图图等显示模式。","p1"],
                    ["变更界面布局","h3"],["自定义三界面占比，其数据自动保存至自定义数据中。","p1"],
                    ["保存界面布局","h3"],["保存占比数据至指定布局数据的指定显示模式下，生成的json数据可自由分享(导出，导入)","p1"]]
                    },
                    ["自定义文本格式","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["自定义地图内容","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["时间线基本操作","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["关注","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["保存关注方案","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["书签","h3"],["界面共3块：地图，文字，时间线","p1"],
                    ["分享","h3"],["导出为json文件，导入指定json文件。"]
                ],
            },
            slwb:{
                descr:{tt:'（一级）标题',gzlb:'关注列表//以“关注列表”的方式摘取时空节点汇集成文。还可以枚举所有相关时空节点。或两者并用。[“han”表示使用“人类(对应节点中的r)”为索引，具体索引关键字为“赵云”]'},
                tt:["赵云传"],    //一级标题
                gzlb:[['han','赵云']],    
                }
            }
        },
    jd:{
        lang:["chs"],
        desc:{bb:"编者",t:[['起年','月','日','时','分','秒',],['止年','月','日','时','分','秒',],['人物1在本年的第几件事','人物2在本年的第几件事……']],},
        bb:["编者：lsj","版本：1"],
        chs:{
            zaoyun191gs:{t:[[191],,{赵云:0}],r:["赵云","公孙瓒"],p:["常山","辽东"],s:[["初平二年，赵云受常山郡（时为常山王国）推举，领本郡义从吏兵"],["投奔公孙瓒,"],["公孙瓒对赵云说：“听说冀州的人都想要依附袁绍，怎么唯独你能迷途知返呢？”赵云回答说：“天下大乱，不知道谁是明主，百姓有倒悬之危，我们常山人经过商议讨论，决定要追随能够实施仁政的地方，并不是因为我们要疏远袁绍而偏向于将军您。”"],["赵云自此随公孙瓒。"]],tag:["事.军.领兵","事.军.行军","言.谈","事.人.效"],kk:99},
            zaoyun191lb:{t:[[191],,{赵云:1}],r:["赵云","刘备"],p:["辽东","青州"],s:[["当时刘备亦依附在公孙瓒处，"],["赵云得以与刘备深交。"],["公孙瓒与袁绍交战，派遣青州刺史田楷占据青州西北部的土地，袁绍亦派数万大军前来争，公孙瓒便上表将刘备提升为别部司马，派刘备前去帮助田楷抵抗袁绍。赵云随刘备出征，"],["为刘备掌管骑兵。"]],tag:["缘.会","事.人.从","事.军.征","事.人.从"],kk:99},
            zaoyun192lb:{t:[[192]],r:["赵云","刘备"],p:["青州"],s:[["后来，赵云因为兄长去世，"],["向公孙瓒请辞归乡，刘备知道赵云此去便不会再回来，因此握着赵云的手不舍得分别。"],["赵云向刘备辞别说：“终不背德也。”"]],tag:["事.人.丧亲","缘.离","言.誓"],kk:99},
            zaoyun200lb:{t:[[200]],r:["赵云","刘备"],p:["邺城",'荆州'],s:[['建安五年,刘备在徐州被曹操打败之后前去依附袁绍。赵云到邺城见到刘备，'],['二人同床眠卧。'],['刘备秘密派遣赵云招募兵士数百，对外宣称是左将军刘备的部曲，而此事袁绍并不知情。'],['刘备在汝南侵扰曹操后方失败后，赵云便随刘备来到荆州依附刘表。']],tag:["缘.会","人.密友","兵.招兵",'人.随'],kk:99},
            zaoyun202lb:{t:[[202]],r:["赵云","刘备",'夏侯兰'],p:["邺城",'荆州'],s:[['建安七年,赵云于博望之战中生擒了敌将夏侯兰。'],['赵云与夏侯兰是同乡，自小相知，于是向刘备求情，免夏侯兰一死。而夏侯兰又明于法律，刘备任用夏侯兰为军正。'],['赵云不任用自己所亲近的人，他的谨慎思虑，正如他不会亲自任用夏侯兰那样。']],tag:['战.擒',"缘.乡，友",'言.评'],kk:99},
            zaoyun208cbp:{t:[[208]],r:["赵云","刘备",'刘禅','甘夫人'],p:['当阳长坂坡'],s:[['建安十三年,曹军追击刘备，到了当阳长坂坡，发现赵云不见了，有人说见赵云往北边去，许是投曹了。刘备直接用手戟打过去说：“子龙是不会弃我而去的。”'],['不久，赵云怀抱刘备的幼子刘禅，保护着刘备的妻子甘夫人，平安地回到刘备身边。'],['此战之后，刘备便任命赵云为牙门将军，入蜀时更被托付留守荆州。']],tag:['言.评','典.七进七出',"人.任",],kk:99},
            zaoyun208jn:{t:[[208,12],[209]],r:["赵云","赵范",'樊氏'],p:['桂阳'],s:[['赤壁之战后，赵云跟随刘备平定荆州四郡。'],['刘备任命赵云为偏将军，并取代投降的赵范，兼任桂阳太守。'],['赵范有一个守寡的嫂嫂姓樊，有倾国的美貌，赵范想将她许配给赵云。但是赵云不同意，推辞说：“我们是同姓，你的嫂子就像是我的嫂子一样。” '],['当时有人劝赵云接受这名美女，赵云回答说：“赵范是被迫投降的，心不可测，何况天下女子不少。”不久之后，赵范果然藉机逃走，而赵云则毫无牵涉。']],tag:['兵.平','人.任','典.赵范献嫂',"言.论",],kk:99},
            zaoyun211jjjad:{t:[[209],[211]],r:["赵云",'刘备','张飞',"孙夫人",'刘禅'],p:['公安','长江'],s:[['先主入益州，云领留营司马。此时先主孙夫人以权妹骄豪，多将吴吏兵，纵横不法。先主以云严重，必能整齐，特任掌内事。'],['权闻备西征，大遣舟船迎妹，而夫人内欲将后主还吴，云与张飞勒兵截江，乃得后主还。']],tag:['人.任','典.截江救阿斗',],kk:99},
            zaoyun213rc:{t:[[213],[214]],r:["赵云",'刘备','张飞',"诸葛亮"],p:['长江','江州','江阳','犍为','成都'],s:[['建安十八年,刘备与刘璋决裂，从葭萌进攻刘璋，并召诸葛亮等人入蜀支援。诸葛亮与赵云、张飞等率军溯江西上，一路平定郡县。在攻克江州后，兵分两路，赵云率军由外水深入，攻取江阳、犍为等郡。 '],['至次年于成都南面，完成对刘璋的包围。'],['刘备攻下成都之后，任命赵云为翊军将军。'],['刘备平定益州之后，有人主张将成都城中房舍及城外园地桑田分赐给诸将。赵云反驳说：“霍去病曾说过匈奴未灭，无以家为，现在国贼不只像匈奴只有一个，所以还不到可以安定下来的时候，须等到天下平定之后，再使众人返回家乡去耕耘田地，这才是最好的决定。益州的百姓，刚刚遭遇战祸，现在应该将田宅房产归还给百姓，先让他们安居乐业，然后可以使他们服兵役、纳户税，这样也能得到益州的民心。”刘备当即便采纳了赵云的建议']],tag:['兵.克','兵.围','人.任','言.谏.从'],kk:99},
            zaoyun219yssd:{t:[[219]],r:["赵云",'刘备','黄忠','张著','张翼'],p:['汉中','定军山？'],s:[['建安二十四年正月，刘备听从法正、黄权等人的建议进攻汉中，汉中守将夏侯渊被黄忠所斩。三月，曹操亲自率领大军来争夺汉中，并运送大量的军粮到北山下，有数千万袋，黄忠认为可趁机夺取这些军粮，赵云于是授予黄忠兵力去取北山。但是黄忠约定的时间之后仍未回来，赵云便带着数十骑出了营寨，查看黄忠等人的情况。恰巧遇到曹操派出的大军，赵云遭到曹军先锋部队的攻击，刚与敌人交手，曹操的大军已来到面前，声势逼人。赵云便一次又一次地突击曹军阵列，且战且退。曹军散而复合，赵云突围而出并退入汉军的营寨内，此时部将张著受伤，又被曹军包围，赵云又一次驰马突击曹军，并救出张著，将他带回营寨内。此时曹军已追至汉军的营寨前，沔阳长张翼正在防守营寨，见曹操大军杀到，便要闭门拒守。赵云进入大营之后，却下令大开营门，然后令汉军偃旗息鼓。曹军见此情况，怀疑赵云设有伏兵，便向后退去。此时赵云下令鸣击战鼓，鼓声震天，又令军士以弩箭射曹军，曹军惊骇，自相蹂践，坠入汉水中淹死者甚多。'],['次日刘备亲自来到赵云兵营察看昨日战斗之处，赞叹说：“子龙一身都是胆也！”'],['于是设宴欢庆直到黄昏，军中称呼赵云为“虎威将军”。']],tag:['兵.战','典.一身是胆','言.誉'],kk:99},
            zaoyun221lb:{t:[[221]],r:["赵云",'刘备'],p:['成都'],s:[['章武元年刘备称帝，欲进攻东吴，以报孙权伐取荆州、杀害关羽之仇，赵云上谏说：“国贼是曹操，并不是孙权，灭了曹魏之后，东吴孙权自然会臣服。虽然曹操已经去世，但其子曹丕篡夺皇位，引起公愤，应该利用此民愤，先攻占关中，占据黄河、渭水上游以讨伐逆贼，那么关东义士必裹粮策马以迎王师。不该放置曹魏，反而先打东吴。而且与东吴的战争一旦开始，就不易停止了，伐吴并非上策。”但愤怒的刘备不听谏言，执意东征，'],['留赵云都督江州。']],tag:['言.谏.拒','人.任.留'],kk:99},
            zaoyun222:{t:[[222]],r:["赵云"],p:['成都','永安'],s:[['章武二年，刘备东征大军败于夷陵，刘备由秭归逃回永安，赵云进军至永安，而吴军已退。']],tag:['兵.行'],kk:99},
            zaoyun223:{t:[[223]],r:["赵云"],p:['成都'],s:[['章武三年,赵云被升任为中护军、征南将军，'],['封爵为永昌亭侯，'],['随后又升迁为镇东将军。']],tag:['人.任.升','人.封','人.任.升'],kk:99},
            zaoyun227:{t:[[227]],r:['赵云','诸葛亮'],p:['汉中'],s:[['建兴五年在平定南中并和东吴结盟之后，诸葛亮率领诸将进驻汉中准备北伐，赵云随诸葛亮'],['转驻汉中。']],tag:['人.随','兵.驻'],kk:99},
            zaoyun228:{t:[[228]],r:['赵云','诸葛亮','邓芝'],p:['箕谷'],s:[['建兴六年，诸葛亮出兵北伐，宣称将由斜谷道出兵，并令赵云、邓芝为疑军，占据箕谷，'],['魏大将军曹真率领大军阻挡，诸葛亮令赵云、邓芝在斜谷道阻挡曹军而自己率领蜀军主力进攻祁山，赵云、邓芝由于兵弱敌强，失利于箕谷，'],['但赵云及时聚拢部队，固守箕谷，没有造成大的损失。'],['部队撤退时，赵云亲自断后，阻止曹军追击，因此军资和人员的损失都不大。'],['蜀军退兵时，诸葛亮曾问：“街亭退兵时，我军编制皆混乱成一团，箕谷退兵，编制整齐一如出军之时，这是何故？”邓芝回答说：“赵将军亲自断后，因此军资没有遗失，人员编制整齐。”'],['当时赵云军中尚有多余的绢布，诸葛亮下令分给赵云部队将士。赵云说：“我军军事失利，怎么还能要赏赐呢？请将这些物资全部纳入赤岸府库，在十月寒冬的时候再赏赐给将士们使用。”'],['诸葛亮对赵云品行大为称赞。']],tag:['兵.据','兵败.','兵守.','兵.退','言.对','言.进','言.赞'],kk:99},
            zaoyun229z:{t:[[229],[261]],r:['赵云','刘禅'],p:['成都'],s:[['建兴七年，赵云去世。'],['景耀四年，刘禅下诏说：“云昔从先帝，功绩既著。朕以幼冲，涉涂艰难，赖恃忠顺，济于危险。夫谥所以叙元勋也，外议云宜谥。”大将军姜维等议，以为云昔从先帝，劳绩既著，经营天下遵奉法度，功效可书。当阳之役，义贯金石。忠以卫上，君念其赏； 礼以厚下，臣忘其死。死者有知，足以不朽；生者感恩，足以殒身。谨按谥法，柔贤慈惠曰顺，执事有班曰平，克定祸乱曰平，应谥云曰顺平侯。'],['赵云有两个儿子，长子赵统继承其爵位，官至虎贲中郎督，行领军；次子赵广官至牙门将，在沓中追随姜维时战死沙场。']],tag:['人.死','言.谥','人.后'],kk:99},
        },
    },
    sjx:{
        tim:[184,60,205],
        gz:1,    //是否显示干支纪年甲乙丙丁戊己庚辛壬癸,子丑寅卯辰巳午未申酉戌亥
        nh:0,    //是否显示年号。
        wx5s:['#00ff00','#ff0000','#996600','#ffff00','#0000ff'],    //五行五色：[木0,火1,土2,金3,水4]
        gzyywx:{g:[['甲',1,0],['乙',0,0],['丙',1,1],['丁',0,1],['戊',1,2],['己',0,2],['庚',1,3],['辛',0,3],['壬',1,4],['癸',0,4]],z:[['子',1,4],['丑',0,2],['寅',1,0],['卯',0,0],['辰',1,2],['巳',0,1],['午',1,1],['未',0,2],['申',1,3],['酉',0,3],['戌',1,2],['亥',0,4]]},    //干支，阴阳：[阴0,阳1],五行：[木0,火1,土2,金3,水4]，
        sx:{g:['阏逢','旃蒙','柔兆','强圉','著雍','屠维','上章','重光','玄黓','昭阳'],z:['困敦','赤奋若','摄提格','单阏','执徐','大荒落','敦牂','协洽','涒滩','作噩','阉茂','大渊献'],c:['星纪','玄枵','娵訾','降娄','大梁','实沈','鹑首','鹑火','鹑尾','寿星','大火','析木']},    //岁星纪年法//c:刘歆,西汉末,十二次。//gz:《尔雅·释天》,太岁纪年法。//木星围绕太阳的公转周期为11.8622年，每年移动的范围比一个星次稍微多一点，渐积至86年，便会多走一个星次，这种情况叫“超辰”或“超次”。//古天文学家把天赤道带均匀地分为十二等分，由西往东，依次是：星纪，玄愕，如訾，降娄，大梁，实沈，鹑首，鹑火，鹑尾，寿星，大火，析木。这正是岁星行进的方向。//太岁：和木星位置相对，不存在木星的逆行且公转周期为12年的一颗假想天体。其星序为自东向西。
    },
}
//地图
const map={
    sg:[{img:{src:"map/sg/base.jpg",siz:[600,609]},year:[160,280],L0:111,touyin:"gauss",dw:[["twn",547,570],["dln",497,126],["amd",362,570]]},
    {img:{src:"map/sg/sg205.jpg",siz:[600,636]},year:[205,206],L0:111,touyin:"gauss",
    dw:[["cangsa",353,353],["cendu",159,319],["cangan",240,209],["loyang",316,192],["wuhan",370,309]
    ,["hanzon",226,259],["amd",364,486],["dln",495,85],["xucang",373,208],["xuzou",446,196]
    ,["yecen",368,160],["xiangyang",298,296],["jinzou",307,323],["jiaozi",208,513],]}],
    cs:{img:{src:"map/cs.jpg",siz:[769,669]},year:[160,280],L0:111,touyin:"webmkt",
    dw:[["cangsa",379,493],["cendu",137,420],["xian",270,299],["jinan",492,222]
    ,["nanjin",538,373],["wuhan",416,419],["nancang",458,479],["kunmin",104,594]
    ,["guiyang",207,541],["conqin",205,451],["senyang",665,47],["hhht",346,77],]},
}

//源文（解析）
const yw={
    sgzzyz:{
        lang:["chs"],
        titl:["三国志","蜀书","赵云传"],
        tisi:["提示","标题，作者，原文，译文/注释"],
        zz:["作者：","陈寿"],
        chs:{
            yw:[['赵云字子龙，常山真定人也。'],['本属公孙瓒，瓒遣先主为田楷拒袁绍，云遂随从，为先主主骑。'],['及先主为曹公所追於当阳长阪，弃妻子南走，云身抱弱子，即后主也，保护甘夫人，即后主母也，皆得免难。'],['迁为牙门将军。先主入蜀，云留荆州。'],['先主自葭萌还攻刘璋，召诸葛亮。'],['亮率云与张飞等俱溯江西上，平定郡县。'],['至江州，分遣云从外水上江阳，与亮会于成都。'],['成都既定，以云为翊军将军。'],['建兴元年，为中护军、征南将军，封永昌亭侯，迁镇东将军。'],['五年，随诸葛亮驻汉中。'],['明年，亮出军，扬声由斜谷道，曹真遣大众当之。'],['亮令云与邓芝往拒，而身攻祁山。'],['云、芝兵弱敌强，失利於箕谷，然敛众固守，不至大败。'],['军退，贬为镇军将军。'],['七年卒，追谥顺平侯。'],['初，先主时，惟法正见谥；后主时，诸葛亮功德盖世，蒋琬、费祎荷国之重，亦见谥；陈祗宠待，特加殊奖，夏侯霸远来归国，故复得谥；於是关羽、张飞、马超、庞统、黄忠及云乃追谥，时论以为荣。'],['云子统嗣，官至虎贲中郎，督行领军。次子广，牙门将，随姜维沓中，临陈战死。'],['评曰：关羽、张飞皆称万人之敌，为世虎臣。羽报效曹公，飞义释严颜，并有国士之风。然羽刚而自矜，飞暴而无恩，以短取败，理数之常也。马超阻戎负勇，以覆其族，惜哉！能因穷致泰，不犹愈乎！黄忠、赵云强挚壮猛，并作爪牙，其灌、滕之徒欤？']],
        },
    },
    yunbz:{
        lang:["chs"],
        titl:["三国志","蜀书","赵云传"],
        tisi:["提示","标题，作者，原文，译文/注释"],
        zz:["作者：","陈寿"],
        chs:{
            yw:[['【云别传曰：云身长八尺，姿颜雄伟，为本郡所举，将义从吏兵诣公孙瓒。时袁绍称冀州牧，瓒深忧州人之从绍也，善云来附，嘲云曰："闻贵州人皆愿袁氏，君何独回心，迷而能反乎？"云答曰："天下讠凶讠凶，未知孰是，民有倒县之厄，鄙州论议，从仁政所在，不为忽袁公私明将军也。"遂与瓒征讨。时先主亦依讬瓒，每接纳云，云得深自结讬。云以兄丧，辞瓒暂归，先主知其不反，捉手而别，云辞曰："终不背德也。"先主就袁绍，云见於邺。先主与云同床眠卧，密遣云合募得数百人，皆称刘左将军部曲，绍不能知。遂随先主至荆州。】'],['【云别传曰：初，先主之败，有人言云已北去者，先主以手戟擿之曰："子龙不弃我走也。"顷之，云至。从平江南，以为偏将军，领桂阳太守，代赵范。范寡嫂曰樊氏，有国色，范欲以配云。云辞曰："相与同姓，卿兄犹我兄。"固辞不许。时有人劝云纳之，云曰："范迫降耳，心未可测；天下女不少。"遂不取。范果逃走，云无纤介。先是，与夏侯惇战於博望，生获夏侯兰。兰是云乡里人，少小相知，云白先主活之，荐兰明於法律，以为军正。云不用自近，其慎虑类如此。先主入益州，云领留营司马。此时先主孙夫人以权妹骄豪，多将吴吏兵，纵横不法。先主以云严重，必能整齐，特任掌内事。权闻备西征，大遣舟船迎妹，而夫人内欲将后主还吴，云与张飞勒兵截江，乃得后主还。】'],['【云别传曰：益州既定，时议欲以成都中屋舍及城外园地桑田分赐诸将。云駮之曰："霍去病以匈奴未灭，无用家为，令国贼非但匈奴，未可求安也。须天下都定，各反桑梓，归耕本土，乃其宜耳。益州人民，初罹兵革，田宅皆可归还，今安居复业，然后可役调，得其欢心。"先主即从之。夏侯渊败，曹公争汉中地，运米北山下，数千万囊。黄忠以为可取，云兵随忠取米。忠过期不还，云将数十骑轻行出围，迎视忠等。值曹公扬兵大出，云为公前锋所击，方战，其大众至，势偪，遂前突其陈，且斗且卻。公军败，已复合，云陷敌，还趣围。将张著被创，云复驰马还营迎著。公军追至围，此时沔阳长张翼在云围内，翼欲闭门拒守，而云入营，更大开门，偃旗息鼓。公军疑云有伏兵，引去。云雷鼓震天，惟以戎弩於后射公军，公军惊骇，自相蹂践，堕汉水中死者甚多。先主明旦自来至云营围视昨战处，曰："子龙一身都是胆也。"作乐饮宴至暝，军中号云为虎威将军。孙权袭荆州，先主大怒，欲讨权。云谏曰："国贼是曹操，非孙权也，且先灭魏，则吴自服。操身虽毙，子丕篡盗，当因众心，早图关中，居河、渭上流以讨凶逆，关东义士必裹粮策马以迎王师。不应置魏，先与吴战；兵势一交，不得卒解也。"先主不听，遂东征，留云督江州。先主失利於秭归，云进兵至永安，吴军已退。】'],['【云别传曰：亮曰："街亭军退，兵将不复相录，箕谷军退，兵将初不相失，何故？"芝答曰："云身自断后，军资什物，略无所弃，兵将无缘相失。"云有军资馀绢，亮使分赐将士，云曰："军事无利，何为有赐？其物请悉入赤岸府库，须十月为冬赐。"亮大善之。】'],['【云别传载后主诏曰："云昔从先帝，功积既著。朕以幼冲，涉涂艰难，赖恃忠顺，济於危险。夫谥所以叙元勋也，外议云宜谥。"大将军姜维等议，以为云昔从先帝，劳绩既著，经营天下，遵奉法度，功效可书。当阳之役，义贯金石，忠以卫上，君念其赏，礼以厚下，臣忘其死。死者有知，足以不朽；生者感恩，足以殒身。谨按谥法，柔贤慈惠曰顺，执事有班曰平，克定祸乱曰平，应谥云曰顺平侯。】'],],
            sw:[],
        },
    }
}//目前无用。将来可做一做解析。



export {dings,bians,map}