const 说明={
    界面说明:["jm:界面。","pst:空间数据，x,y,长，宽。",],
    界面相关变量:["hdn:0隐藏，1显示",
    "sfbl:bl缩放比例，sf:默认5中心缩放；1定左上，向右下缩放。2定（中）上，向下缩放……9定右下，向左上缩放",
    "index:层级，默认0",
    "倾斜：平放，竖起，左侧，右侧",
    "透明度：各图层透明度分配/衰减方案",
    ],
    界面元素:["人类","事类","物类",],
    界面元素属性:['重要性/显著度','影响力','可信/可靠/精确度//演义/离谱度','(读者)关注度：关注，默认，屏蔽'],
}
const sj={
    bgimg:[{src:'img/wbbj0.jpg',siz:[720,720]},{src:'img/sjx0.jpg',siz:[1280,80]},],
    wbkys:{    //文本框样式
        bgse:"#CFE8CC",    //背景色
        bkse:"#007500",    //边框色
        bkxs:3,    //边框粗细（像素）
    },
    msimg:{    //整数与分数模式图片
        src:['img/zsms.png','img/fsms.png'],
    },
}
const pst={
    hporsp:0,
    anniu:[[180,90,0,1190],[180,90,180,1190],[180,90,360,1190],[180,90,540,1190],[180,90,0,1100],[180,90,180,1100],[180,90,360,1100],[180,90,540,1100],[180,90,0,0],[180,90,180,0],[180,90,360,0],[180,90,540,0],],
}
//布局
const buju={
    ms:'mr',
    mr:{
        vs    :[1,2,3,],     //显示模式:[1图，2文，3时间线]；0不显示。。[1,2,3]均衡模式；[1,0,3]图线模式；[0,2,3]文线；[1,2,0]图文；[1,0,0]全图;[0,2,0]全文；[0,0,3]全线；[1,1,3]图图线；[1,1,0]图图；[2,2,3]文文线；[2,2,0]文文。
        bl    :[[1,2],[8,9]],    //显示比例(x占1/2，y占8/9)
    },

}
const map={
    sg:[{img:{src:"map/sg/base.jpg",siz:[600,609]},year:[160,280],L0:111,touyin:"gauss",dw:[["twn",547,570],["dln",497,126],["amd",362,570]]},
    {img:{src:"map/sg/sg205.jpg",siz:[600,636]},year:[205,206],L0:111,touyin:"mokato",dw:[["cangsa",353,353],["cendu",159,319],["cangan",240,209],["loyang",316,192],["hanzon",226,259]]}],
    cs:{img:{src:"map/cs.jpg",siz:[769,669]},year:[160,280],L0:111,touyin:"webmkt",
    dw:[["cangsa",379,493],["cendu",137,420],["xian",270,299],["jinan",492,222]
    ,["nanjin",538,373],["wuhan",416,419],["nancang",458,479],["kunmin",104,594]
    ,["guiyang",207,541],["conqin",205,451],["senyang",665,47],["hhht",346,77],]},
}
//常用地点
const cydd={
    index:{xd:{描述:"现代",time:"now"},},
    xd:{
        twn:["台湾南端",120.46,22],
        dln:["大连",121.36,39.03],
        amd:["澳门附近",113.35,22],
    xian:["西安",108.933,34.345],
    cangan:["长安",108.52,34.15],
    xianyang:["咸阳",108.708,34.333],
    loyang:["洛阳",112.26,34.38],
    denzou:["郑州",113,34.37],
    cendu:["成都",104.04,30.40],
    beijin:["北京",116.23,39.54],
    sanhaig:["山海关",119.36,40],
    jinan:["济南",117,36.40],
    jinzou:["青州",118.03,36.06],
    taiyuan:["太原",112.33,37.54],
    sijianz:["石家庄",114.29,38.03],
    yanmen:["雁门关",113,38],
    wuhan:["武汉",114.23,30.40],
    cangsa:["长沙",112.59,28.12],
    nanjin:["南京",119,32],
    hefei:["合肥",117,32],
    hangzou:["杭州",120,30],
    nancang:["南昌",116.01,28.40],
    lanzou:["兰州",103.48,36.03],
    yincuan:["银川",106.21,38.11],
    senyang:["沈阳",123.23,41.48],
    hhht:["呼和浩特",111.39,40.49],
    kunmin:["昆明",103,25],
    guiyang:["贵阳",107,27],
    conqin:["重庆",106.33,29.35],
    nanyang:["南阳",112.23,34.39],
    xiangyang:["襄阳",112,32],
    cibi:["赤壁",113.52,29.40],
    jiange:["剑阁",105.30,32],
    tiansui:["天水",105,35],
    wuzyuan:["五丈原",107.37,34.17],
    hanzon:["汉中",107,33],
},
}

// //常用地点
// const cydd={
//     index:{xd:{描述:"现代",time:"now"},},
//     xd:{
//         twn:["台湾南端",120.46,22],
//         dln:["大连",121.36,39.03],
//         amd:["澳门附近",113.35,22],
//     xian:["西安",108.55,34.15,108.933,34.345],
//     cangan:["长安",108.52,34.15],
//     xianyang:["咸阳",108.42,34.51,108.708,34.333],
//     loyang:["洛阳",112.26,34.38],
//     denzou:["郑州",113,34.37],
//     cendu:["成都",104.04,30.40],
//     beijin:["北京",116.23,39.54],
//     sanhaig:["山海关",119.36,40],
//     jinan:["济南",117,36.40],
//     jinzou:["青州",118.03,36.06],
//     taiyuan:["太原",112.33,37.54],
//     sijianz:["石家庄",114.29,38.03],
//     yanmen:["雁门关",113,38],
//     wuhan:["武汉",114.23,30.40],
//     cangsa:["长沙",112.59,28.12],
//     nanjin:["南京",119,32],
//     hefei:["合肥",117,32],
//     hangzou:["杭州",120,30],
//     nancang:["南昌",116.01,28.40],
//     lanzou:["兰州",103.48,36.03],
//     yincuan:["银川",106.21,38.11],
//     senyang:["沈阳",123.23,41.48],
//     hhht:["呼和浩特",111.39,40.49],
//     kunmin:["昆明",103,25],
//     guiyang:["贵阳",107,27],
//     conqin:["重庆",106.33,29.35],
//     nanyang:["南阳",112.23,34.39],
//     xiangyang:["襄阳",112,32],
//     cibi:["赤壁",113.52,29.40],
//     jiange:["剑阁",105.30,32],
//     tiansui:["天水",105,35],
//     wuzyuan:["五丈原",107.37,34.17],
//     hanzon:["汉中",107,33],
// },    
// }

export {sj,pst,buju,cydd,map,}